In [16]:
import numpy as np 
import pandas as pd

In [2]:
data1 = {
    'Name' : ['Anu', 'Rani', 'Rohan', 'Mini', 'Rini'], 
    'Age' : [20,23,np.nan ,21,24], 
    'Gender' : ['f', 'm', 'm', np.nan, 'f'], 
    'Salary' : [25,np.nan ,30,40,45], 
    'Purchase' : ['y', 'n', 'y', 'n', 'y']
}

dummy = pd.DataFrame(data1)

In [13]:
dummy.head()

    Name   Age Gender  Salary Purchase
0    Anu  20.0      f    25.0        y
1   Rani  23.0      m     NaN        n
2  Rohan   NaN      m    30.0        y
3   Mini  21.0    NaN    40.0        n
4   Rini  24.0      f    45.0        y

In [6]:
dummy.dtypes

Name         object
Age         float64
Gender       object
Salary      float64
Purchase     object
dtype: object

In [7]:
dummy.shape

(5, 5)

In [50]:
# show only columns that has object type
dummy.select_dtypes(include=object)

    Name Gender Purchase
0    Anu      f        y
1   Rani      m        n
2  Rohan      m        y
3   Mini    NaN        n
4   Rini      f        y

In [12]:
dummy.isnull().sum()

Name        0
Age         1
Gender      1
Salary      1
Purchase    0
dtype: int64

In [13]:
del dummy['Age']

In [15]:
dummy.fillna(1)

    Name Gender  Salary Purchase
0    Anu      f    25.0        y
1   Rani      m     1.0        n
2  Rohan      m    30.0        y
3   Mini      1    40.0        n
4   Rini      f    45.0        y

In [18]:
# combine the two dataset 

data2 = {
    "cgpa": [7,8, 6, 9, 7],
    "iq" : ['A', 'C', 'B', np.nan, 'A']
}

dummy2 = pd.DataFrame(data2)

In [19]:
dummy2

   cgpa   iq
0     7    A
1     8    C
2     6    B
3     9  NaN
4     7    A

In [47]:
dd = pd.concat([dummy, dummy2], axis=1)
dd

    Name Gender  Salary Purchase  cgpa   iq
0    Anu      f    25.0        y     7    A
1   Rani      m     NaN        n     8    C
2  Rohan      m    30.0        y     6    B
3   Mini    NaN    40.0        n     9  NaN
4   Rini      f    45.0        y     7    A

In [28]:
#combine two dataset 
dummy_data = dummy.join(dummy2)

In [29]:
dummy_data

    Name Gender  Salary Purchase  cgpa   iq
0    Anu      f    25.0        y     7    A
1   Rani      m     NaN        n     8    C
2  Rohan      m    30.0        y     6    B
3   Mini    NaN    40.0        n     9  NaN
4   Rini      f    45.0        y     7    A

In [33]:
dummy_data['Salary'].nunique()

4

In [51]:
# display first three unique value in a particular column
dummy_data['Salary'].unique()[:3]

array([25., nan, 30.])